console.log('number' + 3 + 3)  // number33 (Неявне перетворення. Числа перетворені в рядки і виконано конкатинацію рядка)

console.log(null + 3) // 3 (null, може вказувати на нульове значення. О + 3 = 3)

console.log(5 && "qwerty") // qwerty (Оператор "І" повертає останній знайдений результат, при умові, що все інше true)

console.log(+'40' + +'2' + "hillel") // 42hillel (Унарний + завжди призводить до числа. Отже 40 + 2 = 42, потім конкатигація зі строкою)

console.log('10' - 5 === 6) //  false (Виконується строге порівняння, 5 не дорівнює 6, відповідь false)

console.log(true + false ) // 1 (true= 1, false= 0, 1+0=1)

console.log('4px' - 3) // NaN (Не можливо виконати, 4px не приводиться до числа за рахунок присутніх літер  )

console.log('4' - 3) // 1 (JS приводить все до числа. Неявне перетворення, строка читається як число, 4 - 3 = 1)

console.log('6' + 3 ** 0) // 61 (Число в 0 степені = 1. Конкатинація рядка )

console.log(12 / '6') // 2 (JS приводить все до числа, сторока читається як число, 12 / 6 = 2)

console.log('10' + (5 === 6)) // 10false (1 дія строге порівняння, 5 не дорівнює 6. 2 дія конкатинація рядка)

console.log(null == '') //false (null, вказує на нульове значення, строка пуста. Тому 0 не дорівнює пустоті)

console.log(3 ** (9 / 3)) // 27 (1 дія 9 / 3 = 3; 2 дія 3 в 3 ступіні = 27 )

console.log(!!'false' == !!'true') // true (Оператор строгої нерівності !== порівнює два значення на нерівність і виводить true, якщо вони не рівні, або мають різний тип )

console.log(0 || '0' && 1) // 1 (Оператор "І" повертає останній знайдений результат, при умові, що все інше true)

console.log((+null == false) < 1) // false (1 дія +null = 0; 0 = false, результат дії true. 2 дія 1 не більше true )

console.log(false && true || true) // true (1 дія дасть false, тому що оператору "І" потрібно завжди true. 2 дія дасть true, порівняння false або true)

console.log(false && (false || true)) // false (1 дія результат true, 2 дія обчислення припиняється, тому що знайдено false)

console.log((+null == false) < 1 ** 5) // false (1 дія +null = 0; 0 = false, результат дії true. 2 дія 1 в 5 степені = 1, 1 не більше true)

